OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic12f617.h
extern __at(0x0098) volatile __PMCON1bits_t PMCON1bits;

#define _RD                     0x01
#define _WR                     0x02
#define _WREN                   0x04

//==============================================================================

extern __at(0x0099) __sfr PMCON2;

//==============================================================================
//        PMADRL Bits

extern __at(0x009A) __sfr PMADRL;

typedef struct
  {
  unsigned PMADRL0              : 1;
  unsigned PMADRL1              : 1;
  unsigned PMADRL2              : 1;
  unsigned PMADRL3              : 1;
  unsigned PMADRL4              : 1;
  unsigned PMADRL5              : 1;
  unsigned PMADRL6              : 1;
  unsigned PMADRL7              : 1;
  } __PMADRLbits_t;

extern __at(0x009A) volatile __PMADRLbits_t PMADRLbits;

#define _PMADRL0                0x01
#define _PMADRL1                0x02
#define _PMADRL2                0x04
#define _PMADRL3                0x08
#define _PMADRL4                0x10
#define _PMADRL5                0x20
#define _PMADRL6                0x40
#define _PMADRL7                0x80

//==============================================================================


//==============================================================================
//        PMADRH Bits

extern __at(0x009B) __sfr PMADRH;

typedef union
  {
  struct
    {
    unsigned PMADRH0            : 1;
    unsigned PMADRH1            : 1;
    unsigned PMADRH2            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned PMADRH             : 3;
    unsigned                    : 5;
    };
  } __PMADRHbits_t;

extern __at(0x009B) volatile __PMADRHbits_t PMADRHbits;

#define _PMADRH0                0x01
#define _PMADRH1                0x02
#define _PMADRH2                0x04

//==============================================================================


//==============================================================================
//        PMDATL Bits

extern __at(0x009C) __sfr PMDATL;

typedef struct
  {
  unsigned PMDATL0              : 1;
  unsigned PMDATL1              : 1;
  unsigned PMDATL2              : 1;
  unsigned PMDATL3              : 1;
  unsigned PMDATL4              : 1;
  unsigned PMDATL5              : 1;
  unsigned PMDATL6              : 1;
  unsigned PMDATL7              : 1;
  } __PMDATLbits_t;

extern __at(0x009C) volatile __PMDATLbits_t PMDATLbits;

#define _PMDATL0                0x01
#define _PMDATL1                0x02
#define _PMDATL2                0x04
#define _PMDATL3                0x08
#define _PMDATL4                0x10
#define _PMDATL5                0x20
#define _PMDATL6                0x40
#define _PMDATL7                0x80

//==============================================================================

extern __at(0x009D) __sfr PMDATH;
extern __at(0x009E) __sfr ADRESL;

//==============================================================================
//        ANSEL Bits

extern __at(0x009F) __sfr ANSEL;

typedef union
  {
  struct
    {
    unsigned ANS0               : 1;
    unsigned ANS1               : 1;
    unsigned ANS2               : 1;
    unsigned ANS3               : 1;
    unsigned ADCS0              : 1;
    unsigned ADCS1              : 1;
    unsigned ADCS2              : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned ANS                : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned ADCS               : 3;
    unsigned                    : 1;
    };
  } __ANSELbits_t;

extern __at(0x009F) volatile __ANSELbits_t ANSELbits;

#define _ANS0                   0x01
#define _ANS1                   0x02
#define _ANS2                   0x04
#define _ANS3                   0x08
#define _ADCS0                  0x10
#define _ADCS1                  0x20
#define _ADCS2                  0x40

//==============================================================================


//==============================================================================
//
//        Configuration Bits
//
//==============================================================================

#define _CONFIG                 0x2007

//----------------------------- CONFIG Options -------------------------------

#define _FOSC_LP                0x3FF8  // LP oscillator: Low-power crystal on RA5/T1CKI/OSC1/CLKIN and RA4/AN3/T1G/OSC2/CLKOUT.
#define _LP_OSC                 0x3FF8  // LP oscillator: Low-power crystal on RA5/T1CKI/OSC1/CLKIN and RA4/AN3/T1G/OSC2/CLKOUT.
#define _FOSC_XT                0x3FF9  // XT oscillator: Crystal/resonator on RA5/T1CKI/OSC1/CLKIN and RA4/AN3/T1G/OSC2/CLKOUT.
#define _XT_OSC                 0x3FF9  // XT oscillator: Crystal/resonator on RA5/T1CKI/OSC1/CLKIN and RA4/AN3/T1G/OSC2/CLKOUT.
#define _FOSC_HS                0x3FFA  // HS oscillator: High-speed crystal/resonator on RA5/T1CKI/OSC1/CLKIN and RA4/AN3/T1G/OSC2/CLKOUT.
#define _HS_OSC                 0x3FFA  // HS oscillator: High-speed crystal/resonator on RA5/T1CKI/OSC1/CLKIN and RA4/AN3/T1G/OSC2/CLKOUT.
#define _FOSC_EC                0x3FFB  // EC: I/O function on RA4/AN3/T1G/OSC2/CLKOUT, CLKIN on RA5/T1CKI/OSC1/CLKIN.
#define _EC_OSC                 0x3FFB  // EC: I/O function on RA4/AN3/T1G/OSC2/CLKOUT, CLKIN on RA5/T1CKI/OSC1/CLKIN.
#define _FOSC_INTOSCIO          0x3FFC  // INTOSCIO oscillator: I/O function on RA4/AN3/T1G/OSC2/CLKOUT, I/O function on RA5/T1CKI/OSC1/CLKIN.
#define _INTRC_OSC_NOCLKOUT     0x3FFC  // INTOSCIO oscillator: I/O function on RA4/AN3/T1G/OSC2/CLKOUT, I/O function on RA5/T1CKI/OSC1/CLKIN.
#define _FOSC_INTOSCCLK         0x3FFD  // INTOSC oscillator: CLKOUT function on RA4/AN3/T1G/OSC2/CLKOUT, I/O function on RA5/T1CKI/OSC1/CLKIN.
#define _INTRC_OSC_CLKOUT       0x3FFD  // INTOSC oscillator: CLKOUT function on RA4/AN3/T1G/OSC2/CLKOUT, I/O function on RA5/T1CKI/OSC1/CLKIN.
#define _FOSC_EXTRCIO           0x3FFE  // EXTRCIO oscillator: I/O function on RA4/AN3/T1G/OSC2/CLKOUT, RC on RA5/T1CKI/OSC1/CLKIN.
#define _EXTRC_OSC_NOCLKOUT     0x3FFE  // EXTRCIO oscillator: I/O function on RA4/AN3/T1G/OSC2/CLKOUT, RC on RA5/T1CKI/OSC1/CLKIN.
#define _FOSC_EXTRCCLK          0x3FFF  // EXTRC oscillator: CLKOUT function on RA4/AN3/T1G/OSC2/CLKOUT, RC on RA5/T1CKI/OSC1/CLKIN.
#define _EXTRC_OSC_CLKOUT       0x3FFF  // EXTRC oscillator: CLKOUT function on RA4/AN3/T1G/OSC2/CLKOUT, RC on RA5/T1CKI/OSC1/CLKIN.
#define _WDTE_OFF               0x3FF7  // WDT disabled and can be enabled by SWDTEN bit of the WDTCON register.
#define _WDT_OFF                0x3FF7  // WDT disabled and can be enabled by SWDTEN bit of the WDTCON register.
#define _WDTE_ON                0x3FFF  // WDT enabled.
#define _WDT_ON                 0x3FFF  // WDT enabled.
#define _PWRTE_ON               0x3FEF  // PWRT enabled.
#define _PWRTE_OFF              0x3FFF  // PWRT disabled.
#define _MCLRE_OFF              0x3FDF  // MCLR pin is alternate function, MCLR function is internally disabled.
#define _MCLRE_ON               0x3FFF  // MCLR pin is MCLR function and weak internal pull-up is enabled.
#define _CP_ON                  0x3FBF  // Program memory is external read and write protected.
#define _CP_OFF                 0x3FFF  // Program memory is not code protected.
#define _IOSCFS_4MHZ            0x3F7F  // 4 MHz.
#define _IOSCFS_8MHZ            0x3FFF  // 8 MHz.
#define _BOREN_OFF              0x3CFF  // BOR disabled.
#define _BOR_OFF                0x3CFF  // BOR disabled.
#define _BOREN_NSLEEP           0x3EFF  // BOR enabled during operation and disabled in Sleep.
#define _BOR_NSLEEP             0x3EFF  // BOR enabled during operation and disabled in Sleep.
#define _BOREN_ON               0x3FFF  // BOR enabled.
#define _BOR_ON                 0x3FFF  // BOR enabled.
#define _WRT_ALL                0x33FF  // 000h to 7FFh write protected, entire program memory is write protected.
#define _WRT_HALF               0x37FF  // 000h to 3FFh write protected, 400h to 7FFh may be modified by PMCON1 control.
#define _WRT_BOOT               0x3BFF  // 000h to 1FFh write protected, 200h to 7FFh may be modified by PMCON1 control.
#define _WRT_OFF                0x3FFF  // Write protection off.

//==============================================================================

#define _DEVID1                 0x2006

#define _IDLOC0                 0x2000
#define _IDLOC1                 0x2001
#define _IDLOC2                 0x2002
#define _IDLOC3                 0x2003

//==============================================================================

