OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic12f617.h
#ifndef NO_BIT_DEFINES

#define ADON                    ADCON0bits.ADON                 // bit 0
#define GO_NOT_DONE             ADCON0bits.GO_NOT_DONE          // bit 1
#define CHS0                    ADCON0bits.CHS0                 // bit 2
#define CHS1                    ADCON0bits.CHS1                 // bit 3
#define CHS2                    ADCON0bits.CHS2                 // bit 4
#define VCFG                    ADCON0bits.VCFG                 // bit 6
#define ADFM                    ADCON0bits.ADFM                 // bit 7

#define ANS0                    ANSELbits.ANS0                  // bit 0
#define ANS1                    ANSELbits.ANS1                  // bit 1
#define ANS2                    ANSELbits.ANS2                  // bit 2
#define ANS3                    ANSELbits.ANS3                  // bit 3
#define ADCS0                   ANSELbits.ADCS0                 // bit 4
#define ADCS1                   ANSELbits.ADCS1                 // bit 5
#define ADCS2                   ANSELbits.ADCS2                 // bit 6

#define P1ASEL                  APFCONbits.P1ASEL               // bit 0
#define P1BSEL                  APFCONbits.P1BSEL               // bit 1
#define T1GSEL                  APFCONbits.T1GSEL               // bit 4

#define CCP1M0                  CCP1CONbits.CCP1M0              // bit 0
#define CCP1M1                  CCP1CONbits.CCP1M1              // bit 1
#define CCP1M2                  CCP1CONbits.CCP1M2              // bit 2
#define CCP1M3                  CCP1CONbits.CCP1M3              // bit 3
#define DCB0                    CCP1CONbits.DCB0                // bit 4
#define DCB1                    CCP1CONbits.DCB1                // bit 5
#define P1M                     CCP1CONbits.P1M                 // bit 7

#define CMCH                    CMCON0bits.CMCH                 // bit 0, shadows bit in CMCON0bits
#define C1CH                    CMCON0bits.C1CH                 // bit 0, shadows bit in CMCON0bits
#define CMR                     CMCON0bits.CMR                  // bit 2, shadows bit in CMCON0bits
#define C1R                     CMCON0bits.C1R                  // bit 2, shadows bit in CMCON0bits
#define CMPOL                   CMCON0bits.CMPOL                // bit 4, shadows bit in CMCON0bits
#define C1POL                   CMCON0bits.C1POL                // bit 4, shadows bit in CMCON0bits
#define CMOE                    CMCON0bits.CMOE                 // bit 5, shadows bit in CMCON0bits
#define C1OE                    CMCON0bits.C1OE                 // bit 5, shadows bit in CMCON0bits
#define COUT                    CMCON0bits.COUT                 // bit 6, shadows bit in CMCON0bits
#define C1OUT                   CMCON0bits.C1OUT                // bit 6, shadows bit in CMCON0bits
#define CMON                    CMCON0bits.CMON                 // bit 7, shadows bit in CMCON0bits
#define C1ON                    CMCON0bits.C1ON                 // bit 7, shadows bit in CMCON0bits

#define CMSYNC                  CMCON1bits.CMSYNC               // bit 0, shadows bit in CMCON1bits
#define C1SYNC                  CMCON1bits.C1SYNC               // bit 0, shadows bit in CMCON1bits
#define T1GSS                   CMCON1bits.T1GSS                // bit 1
#define CMHYS                   CMCON1bits.CMHYS                // bit 3, shadows bit in CMCON1bits
#define C1HYS                   CMCON1bits.C1HYS                // bit 3, shadows bit in CMCON1bits
#define T1ACS                   CMCON1bits.T1ACS                // bit 4

#define PSSBD0                  ECCPASbits.PSSBD0               // bit 0
#define PSSBD1                  ECCPASbits.PSSBD1               // bit 1
#define PSSAC0                  ECCPASbits.PSSAC0               // bit 2
#define PSSAC1                  ECCPASbits.PSSAC1               // bit 3
#define ECCPAS0                 ECCPASbits.ECCPAS0              // bit 4
#define ECCPAS1                 ECCPASbits.ECCPAS1              // bit 5
#define ECCPAS2                 ECCPASbits.ECCPAS2              // bit 6
#define ECCPASE                 ECCPASbits.ECCPASE              // bit 7

#define GP0                     GPIObits.GP0                    // bit 0, shadows bit in GPIObits
#define GPIO0                   GPIObits.GPIO0                  // bit 0, shadows bit in GPIObits
#define RA0                     GPIObits.RA0                    // bit 0, shadows bit in GPIObits
#define GP1                     GPIObits.GP1                    // bit 1, shadows bit in GPIObits
#define GPIO1                   GPIObits.GPIO1                  // bit 1, shadows bit in GPIObits
#define RA1                     GPIObits.RA1                    // bit 1, shadows bit in GPIObits
#define GP2                     GPIObits.GP2                    // bit 2, shadows bit in GPIObits
#define GPIO2                   GPIObits.GPIO2                  // bit 2, shadows bit in GPIObits
#define RA2                     GPIObits.RA2                    // bit 2, shadows bit in GPIObits
#define GP3                     GPIObits.GP3                    // bit 3, shadows bit in GPIObits
#define GPIO3                   GPIObits.GPIO3                  // bit 3, shadows bit in GPIObits
#define RA3                     GPIObits.RA3                    // bit 3, shadows bit in GPIObits
#define GP4                     GPIObits.GP4                    // bit 4, shadows bit in GPIObits
#define GPIO4                   GPIObits.GPIO4                  // bit 4, shadows bit in GPIObits
#define RA4                     GPIObits.RA4                    // bit 4, shadows bit in GPIObits
#define GP5                     GPIObits.GP5                    // bit 5, shadows bit in GPIObits
#define GPIO5                   GPIObits.GPIO5                  // bit 5, shadows bit in GPIObits
#define RA5                     GPIObits.RA5                    // bit 5, shadows bit in GPIObits

#define GPIF                    INTCONbits.GPIF                 // bit 0
#define INTF                    INTCONbits.INTF                 // bit 1
#define T0IF                    INTCONbits.T0IF                 // bit 2, shadows bit in INTCONbits
#define TMR0IF                  INTCONbits.TMR0IF               // bit 2, shadows bit in INTCONbits
#define GPIE                    INTCONbits.GPIE                 // bit 3
#define INTE                    INTCONbits.INTE                 // bit 4
#define T0IE                    INTCONbits.T0IE                 // bit 5, shadows bit in INTCONbits
#define TMR0IE                  INTCONbits.TMR0IE               // bit 5, shadows bit in INTCONbits
#define PEIE                    INTCONbits.PEIE                 // bit 6
#define GIE                     INTCONbits.GIE                  // bit 7

#define IOC0                    IOCbits.IOC0                    // bit 0, shadows bit in IOCbits
#define IOCA0                   IOCbits.IOCA0                   // bit 0, shadows bit in IOCbits
#define IOC1                    IOCbits.IOC1                    // bit 1, shadows bit in IOCbits
#define IOCA1                   IOCbits.IOCA1                   // bit 1, shadows bit in IOCbits
#define IOC2                    IOCbits.IOC2                    // bit 2, shadows bit in IOCbits
#define IOCA2                   IOCbits.IOCA2                   // bit 2, shadows bit in IOCbits
#define IOC3                    IOCbits.IOC3                    // bit 3, shadows bit in IOCbits
#define IOCA3                   IOCbits.IOCA3                   // bit 3, shadows bit in IOCbits
#define IOC4                    IOCbits.IOC4                    // bit 4, shadows bit in IOCbits
#define IOCA4                   IOCbits.IOCA4                   // bit 4, shadows bit in IOCbits
#define IOC5                    IOCbits.IOC5                    // bit 5, shadows bit in IOCbits
#define IOCA5                   IOCbits.IOCA5                   // bit 5, shadows bit in IOCbits

#define PS0                     OPTION_REGbits.PS0              // bit 0
#define PS1                     OPTION_REGbits.PS1              // bit 1
#define PS2                     OPTION_REGbits.PS2              // bit 2
#define PSA                     OPTION_REGbits.PSA              // bit 3
#define T0SE                    OPTION_REGbits.T0SE             // bit 4
#define T0CS                    OPTION_REGbits.T0CS             // bit 5
#define INTEDG                  OPTION_REGbits.INTEDG           // bit 6
#define NOT_GPPU                OPTION_REGbits.NOT_GPPU         // bit 7

