OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic12f617.h
#define TUN0                    OSCTUNEbits.TUN0                // bit 0
#define TUN1                    OSCTUNEbits.TUN1                // bit 1
#define TUN2                    OSCTUNEbits.TUN2                // bit 2
#define TUN3                    OSCTUNEbits.TUN3                // bit 3
#define TUN4                    OSCTUNEbits.TUN4                // bit 4

#define NOT_BOR                 PCONbits.NOT_BOR                // bit 0
#define NOT_POR                 PCONbits.NOT_POR                // bit 1

#define TMR1IE                  PIE1bits.TMR1IE                 // bit 0
#define TMR2IE                  PIE1bits.TMR2IE                 // bit 1
#define CMIE                    PIE1bits.CMIE                   // bit 3, shadows bit in PIE1bits
#define C1IE                    PIE1bits.C1IE                   // bit 3, shadows bit in PIE1bits
#define CCP1IE                  PIE1bits.CCP1IE                 // bit 5, shadows bit in PIE1bits
#define CCPIE                   PIE1bits.CCPIE                  // bit 5, shadows bit in PIE1bits
#define ECCPIE                  PIE1bits.ECCPIE                 // bit 5, shadows bit in PIE1bits
#define ADIE                    PIE1bits.ADIE                   // bit 6

#define TMR1IF                  PIR1bits.TMR1IF                 // bit 0
#define TMR2IF                  PIR1bits.TMR2IF                 // bit 1
#define CMIF                    PIR1bits.CMIF                   // bit 3, shadows bit in PIR1bits
#define C1IF                    PIR1bits.C1IF                   // bit 3, shadows bit in PIR1bits
#define CCP1IF                  PIR1bits.CCP1IF                 // bit 5, shadows bit in PIR1bits
#define CCPIF                   PIR1bits.CCPIF                  // bit 5, shadows bit in PIR1bits
#define ECCPIF                  PIR1bits.ECCPIF                 // bit 5, shadows bit in PIR1bits
#define ADIF                    PIR1bits.ADIF                   // bit 6

#define PMADRH0                 PMADRHbits.PMADRH0              // bit 0
#define PMADRH1                 PMADRHbits.PMADRH1              // bit 1
#define PMADRH2                 PMADRHbits.PMADRH2              // bit 2

#define PMADRL0                 PMADRLbits.PMADRL0              // bit 0
#define PMADRL1                 PMADRLbits.PMADRL1              // bit 1
#define PMADRL2                 PMADRLbits.PMADRL2              // bit 2
#define PMADRL3                 PMADRLbits.PMADRL3              // bit 3
#define PMADRL4                 PMADRLbits.PMADRL4              // bit 4
#define PMADRL5                 PMADRLbits.PMADRL5              // bit 5
#define PMADRL6                 PMADRLbits.PMADRL6              // bit 6
#define PMADRL7                 PMADRLbits.PMADRL7              // bit 7

#define RD                      PMCON1bits.RD                   // bit 0
#define WR                      PMCON1bits.WR                   // bit 1
#define WREN                    PMCON1bits.WREN                 // bit 2

#define PMDATL0                 PMDATLbits.PMDATL0              // bit 0
#define PMDATL1                 PMDATLbits.PMDATL1              // bit 1
#define PMDATL2                 PMDATLbits.PMDATL2              // bit 2
#define PMDATL3                 PMDATLbits.PMDATL3              // bit 3
#define PMDATL4                 PMDATLbits.PMDATL4              // bit 4
#define PMDATL5                 PMDATLbits.PMDATL5              // bit 5
#define PMDATL6                 PMDATLbits.PMDATL6              // bit 6
#define PMDATL7                 PMDATLbits.PMDATL7              // bit 7

#define PDC0                    PWM1CONbits.PDC0                // bit 0
#define PDC1                    PWM1CONbits.PDC1                // bit 1
#define PDC2                    PWM1CONbits.PDC2                // bit 2
#define PDC3                    PWM1CONbits.PDC3                // bit 3
#define PDC4                    PWM1CONbits.PDC4                // bit 4
#define PDC5                    PWM1CONbits.PDC5                // bit 5
#define PDC6                    PWM1CONbits.PDC6                // bit 6
#define PRSEN                   PWM1CONbits.PRSEN               // bit 7

#define C                       STATUSbits.C                    // bit 0
#define DC                      STATUSbits.DC                   // bit 1
#define Z                       STATUSbits.Z                    // bit 2
#define NOT_PD                  STATUSbits.NOT_PD               // bit 3
#define NOT_TO                  STATUSbits.NOT_TO               // bit 4
#define RP0                     STATUSbits.RP0                  // bit 5
#define RP1                     STATUSbits.RP1                  // bit 6
#define IRP                     STATUSbits.IRP                  // bit 7

#define TMR1ON                  T1CONbits.TMR1ON                // bit 0
#define TMR1CS                  T1CONbits.TMR1CS                // bit 1
#define NOT_T1SYNC              T1CONbits.NOT_T1SYNC            // bit 2
#define T1OSCEN                 T1CONbits.T1OSCEN               // bit 3
#define T1CKPS0                 T1CONbits.T1CKPS0               // bit 4
#define T1CKPS1                 T1CONbits.T1CKPS1               // bit 5
#define TMR1GE                  T1CONbits.TMR1GE                // bit 6
#define T1GINV                  T1CONbits.T1GINV                // bit 7

#define T2CKPS0                 T2CONbits.T2CKPS0               // bit 0
#define T2CKPS1                 T2CONbits.T2CKPS1               // bit 1
#define TMR2ON                  T2CONbits.TMR2ON                // bit 2
#define TOUTPS0                 T2CONbits.TOUTPS0               // bit 3
#define TOUTPS1                 T2CONbits.TOUTPS1               // bit 4
#define TOUTPS2                 T2CONbits.TOUTPS2               // bit 5
#define TOUTPS3                 T2CONbits.TOUTPS3               // bit 6

#define TRISIO0                 TRISAbits.TRISIO0               // bit 0, shadows bit in TRISAbits
#define TRISA0                  TRISAbits.TRISA0                // bit 0, shadows bit in TRISAbits
#define TRISIO1                 TRISAbits.TRISIO1               // bit 1, shadows bit in TRISAbits
#define TRISA1                  TRISAbits.TRISA1                // bit 1, shadows bit in TRISAbits
#define TRISIO2                 TRISAbits.TRISIO2               // bit 2, shadows bit in TRISAbits
#define TRISA2                  TRISAbits.TRISA2                // bit 2, shadows bit in TRISAbits
#define TRISIO3                 TRISAbits.TRISIO3               // bit 3, shadows bit in TRISAbits
#define TRISA3                  TRISAbits.TRISA3                // bit 3, shadows bit in TRISAbits
#define TRISIO4                 TRISAbits.TRISIO4               // bit 4, shadows bit in TRISAbits
#define TRISA4                  TRISAbits.TRISA4                // bit 4, shadows bit in TRISAbits
#define TRISIO5                 TRISAbits.TRISIO5               // bit 5, shadows bit in TRISAbits
#define TRISA5                  TRISAbits.TRISA5                // bit 5, shadows bit in TRISAbits

#define VR0                     VRCONbits.VR0                   // bit 0
#define VR1                     VRCONbits.VR1                   // bit 1
#define VR2                     VRCONbits.VR2                   // bit 2
#define VR3                     VRCONbits.VR3                   // bit 3
#define FVREN                   VRCONbits.FVREN                 // bit 4
#define VRR                     VRCONbits.VRR                   // bit 5
#define CMVREN                  VRCONbits.CMVREN                // bit 7, shadows bit in VRCONbits
#define C1VREN                  VRCONbits.C1VREN                // bit 7, shadows bit in VRCONbits

#define WPU0                    WPUbits.WPU0                    // bit 0, shadows bit in WPUbits
#define WPUA0                   WPUbits.WPUA0                   // bit 0, shadows bit in WPUbits
#define WPU1                    WPUbits.WPU1                    // bit 1, shadows bit in WPUbits
#define WPUA1                   WPUbits.WPUA1                   // bit 1, shadows bit in WPUbits
#define WPU2                    WPUbits.WPU2                    // bit 2, shadows bit in WPUbits
#define WPUA2                   WPUbits.WPUA2                   // bit 2, shadows bit in WPUbits
#define WPU4                    WPUbits.WPU4                    // bit 4, shadows bit in WPUbits
#define WPUA4                   WPUbits.WPUA4                   // bit 4, shadows bit in WPUbits
#define WPU5                    WPUbits.WPU5                    // bit 5, shadows bit in WPUbits
#define WPUA5                   WPUbits.WPUA5                   // bit 5, shadows bit in WPUbits

#endif // #ifndef NO_BIT_DEFINES

#endif // #ifndef __PIC12F617_H__
